{
    "1":{
        "id":"1",
        "title":"Should you be training to failure?",
        "image":"https://miro.medium.com/max/818/1*GAdF2BEP4NtV8p-TO2ePsA.jpeg",
        "description":"Failure doesn't sound good to anyone. But in bodybuilding, failure is essential. Or is it? Failure is the point at which whatever muscle/body part you are working on can't complete another repetition.",
        "content":"<p> Failure doesn't sound good to anyone. But in bodybuilding, failure is essential. Or is it?</p> <br /> <p>Failure is the point at which whatever muscle/body part you are working on can't complete another repetition. Training to failure increases your lactic acid production, which is critical for muscle growth as they increase the growth factors in our body. </p><br /> <p>Although they may have their own benefits, it also comes with certain risks. Since training to fail taxes your central nervous system, the following sets will be performed at a much lower capacity. It may also result in using the improper form when performing exercises. If you’re struggling with a move while using a challenging weight you may not focus on the correct technique. But how do you avoid serious injuries and maximize your muscle/strength using failure as a tool? </p><br> <p><b>1.Technical failure:</b> <br> It is important to know when to give up. Unlike with absolute failure, when you can’t lift that barbell and do that curl at all, technical failure is when you perform a set with the correct form on each repetition until you’re unable to maintain the proper form.</p> <br> <p><b>2. Don't fail in compound movements:</b> <br>It’s not so much of a problem with exercises like the leg extension or dumbbell curl, which don’t require a great deal of skill to perform. But training to failure on big compound lifts like the squat and deadlift, where technique is paramount, isn’t a great idea. Your form can break down before you hit failure, increasing the risk of tears, strains happening to your body.</p> <br> <p><b>3. Use failure to improve your muscular endurance:</b> <br> Building endurance alters your muscles at the microscopic level, which improves your recovery between heavy sets at the gym.</p> <br> <p><b>Conclusion:</b> <br> Periodize your workouts and focus on cycles where you work on training intensity and lifting to failure and then cycles where you focus more on volume and avoid working to complete failure. Remember that you’re still doing something good for your body when you lift weights even if it means you don't go till failure.</p>",
        "date":"May 4, 2021"
    },
    "2":{
        "id":"2",
        "title":"Embracing your chaotic mind",
        "image":"https://miro.medium.com/max/875/1*TtSPIL1SR8MplQ_eN0UuIA.jpeg",
        "description":"We live in chaotic times. Fast-paced modern living takes our days and weeks up, mad rushing to get a lot done each day, crazy amounts of information and messages vying for our attention, and more and more stuff going on around the world.",
        "content":" <p> We live in chaotic times. Fast-paced modern living takes our days and weeks up, mad rushing to get a lot done each day, crazy amounts of information and messages vying for our attention, and more and more stuff going on around the world. As fast as one thought comes, another replaces it. Each one is just as important as the last. </p> <br /> <p> It seems there is no end to the relentless assault of thoughts that jump from neuron to neuron in our brain. These tiny demons have long plagued our heads and have made it a challenge to lead peaceful lives. </p> <br /> <p> It seems there is no end to the relentless assault of thoughts that jump from neuron to neuron in our brain. These tiny demons have long plagued our heads and have made it a challenge to lead peaceful lives. </p> <br /> <p> Chaos is new, unexpected, and sometimes even undesired and distressing. But embracing chaos as a positive in our lives is a wonderful way to deal with the unknowns and the possibilities of how things might be. It can help us become perceptive, creative, and sometimes even empathetic towards others. When we attempt to tame the innate chaos in life and control all that cannot be controlled, it can cause us to feel depressed, anxious, or sad. </p> <br /> <p> Therefore, it’s important to not go against your mind and learn to navigate through the chaos. </p> <br /> <p><b>1.Do not control the “uncontrollable”:</b></p> <br /> <p> We can plan for the future, but most of the variables that can change our plans in the future are unpredictable, so focus instead on what you can control. </p> <br /> <p><b>2. Listen to your mind:</b></p> <br /> <p> Most of us try to ignore our mind’s chatter and that could lead to a build-up of thoughts. Our mind is like a child that throws a tantrum whenever it isn’t given enough attention. So, learn to observe your thoughts without being impulsive. </p> <br /> <p><b>3. Strategise:</b></p> <br /> <p> Think about your thinking. What can I do differently next time? How can I handle this situation now? When we encounter an impulse, it’s better to be patient while deciding on it. </p> <br /> <p><b>4. Be present: </b></p> <br /> <p> Whenever it feels like the world’s falling down on you or you’re just having a bad day, the challenges to presence abound. it’s impossible to be present 100% of the time. Instead of thinking about what mattered in the past or what the future might hold, ask yourself the following questions: <ol> <li><span>1. What is missing from the moment?</span></li> <li><span>2. What would I like to change about today’s unpleasant feeling?</span></li> </ol> </p> <br /> <p><b>Conclusion:</p> <br /> <p> Don’t fight what is in your nature. So what if you have a chaotic mind? You just need to approach it from a different angle. </p> <br /> ",
        "date":"April 29, 2021"    
    },
    "3":{
        "id":"3",
        "title":"The beauty of not knowing",
        "image":"https://miro.medium.com/max/625/1*3pg2PFH-dbQEVOogIT_EbA.jpeg",
        "description":"“To know” is a practice that makes us feel safe. Within the known, we can confidently make plans and stand on the grounds of our knowledge. But what happens when we venture out into the unknown? Our generation perceives “not knowing” as an admission of failure. It is almost like being asked what we’re doing with our lives when the truth is that we have no idea.",
        "content":"<p>“To know” is a practice that makes us feel safe. Within the known, we can confidently make plans and stand on the grounds of our knowledge. But what happens when we venture out into the unknown? </p> <br /> <p> Our generation perceives “not knowing” as an admission of failure. It is almost like being asked what we’re doing with our lives when the truth is that we have no idea. We feel confused, embarrassed to admit our shortcomings, and like a failure. </p> <br /> <p> We think that, because we can describe something with a lot of words, we know what it is. Our lives are just perceptions of the information we receive from our senses. For example, do we know what a bird is, for instance? Or is it more than we can simply describe it or point at it? Is hearing about something or describing that something the same as knowing what that something is? </p> <br /> <p> But a life without the unknown is stagnant. It is a collection of facts we’ve learned from the deeds and achievements of someone else who was brave enough to venture into the mystery of the unknown to discover it all for themselves. </p> <br /> <p> The beauty of “not knowing” comes from not having more stuff to think about. We’re free to focus on what’s important to us. Nothing else gets in our way to cloud our thoughts and distract us from our priorities. </p> <br /> <p> Although you shouldn’t stop learning (and growing) every day, you need restraint on what you learn and how much to learn. This is done the same way you decide which task to work on. Start with the most important one that will achieve the biggest result in what you want to accomplish. </p> <br /> <p> <b>Conclusion:</b> </p> <br /> <p> Our lives are our body of work. So, you may not know what you are doing, but you know you, and that creative exploration is your greatest work. </p> <br />",
        "date":"March 23, 2021"    
    },
    "4":{
        "id":"4",
        "title":"What is super-compensation?",
        "image":"https://miro.medium.com/max/1400/1*0CLDfNpRcu7iSQ5xD7Up_g.jpeg",
        "description":"The body is always seeking to maintain a state of equilibrium so it will constantly adapt to the stress from its environment. Training is simply the manipulation of the application of stress and the body’s subsequent adaptation to that stress to maintain equilibrium.",
        "content":"<p>The body is always seeking to maintain a state of equilibrium so it will constantly adapt to the stress from its environment. Training is simply the manipulation of the application of stress and the body’s subsequent adaptation to that stress to maintain equilibrium. </p> <br /> <p> It’s no secret that being consistent and putting in hard work is the backbone of success. However, for physical training, have you ever considered the timing and the intensity of your sessions and how well they’re balanced with recovery? </p> <br /> <p> It's about laying down your goals and objectives for a workout and what level of recovery is required in order to maximize the benefit of that workout. You might’ve seen your performance reduced if you hadn’t given enough recovery after your high-intensity sessions. What’s the solution you might ask? Well, an understanding of overcompensation or super-compensation theory might explain it. </p> <br /> <p> Super-compensation is the theory that after training, the body recovers above and beyond pre-training fitness levels. This adaptation is the essence of physical training and enables us to improve our fitness. </p> <br /> <p>There are 4 stages in super-compensation theory:</p> <br /> <p> <b>1. Training/Exercise:</b> </p> <br /> <p> First, we must apply a training stimulus to our bodies at the right intensity. It’s incredibly important that the intensity of this training be appropriate for the individual. In short, the first step involves an improvement in an individual’s fitness level. </p> <br /> <p> <b>2. Recovery:</b> </p> <br /> <p> Training causes fatigue (for example dehydration, micro damages in our muscles). This requires an appropriate amount of time for recovery. Super-compensation theory only works when the individual fully recovers from the training stimulus and has peaked into a super-compensation zone. Repeatedly overtaxing the body without properly recovering often leads to plateaued or declining performance. </p> <br /> <p> <b>3. Supercompensation:</b> </p> <br /> <p> This adaptation to the initial training stress allows the individual to execute at a higher level than before. The body recovers beyond baseline fitness levels in anticipation of future exercise. </p> <br /> <p> <b>4. De-training:</b> </p> <br /> <p> Our body follows a “use it or lose it” pattern. If no further training takes place during the super-compensation phase, the body will return to pre-training fitness levels. The amazing thing about our bodies is that after exercise, we recover beyond pre-training levels. This is super-compensation, and it occurs at every level of our physiology, from muscle fiber size to mitochondrial density to glycogen storage. In effect, your body prepares itself for a higher level of stress to the system. </p> <br /> <p> <b>How to train for super-compensation?</b> </p> <br /> <p> Keep detailed training logs that include your workouts, nutrition, hours of sleep, work and personal stressors, etc. Everything that happens between the end of one workout and the beginning of another is an important factor in your training. Identify the points of recovery which leads to improved performance and adjust your training periods accordingly. </p> <br /> <p> <b>Conclusion:</b> </p> <br /> <p> Keep in mind that every individual is different. Spend the time experimenting and get your training week dialed in. The experience will be your guide as you learn to balance load and recovery for maximum effect. Hence, eat well, sleep well, train consistently and progress slowly. </p> <br />",
        "date":"February 12, 2021"    
    },
    "5":{
        "id":"5",
        "title":"What To Do When You Aren’t Passionate About Anything?",
        "image":"https://miro.medium.com/max/1044/1*6SMtg5WaP3TWeIqmhhPV9A.gif",
        "description":"When you were a kid, you would just do things, right? You never thought about the merits of your actions. The beautiful thing was when you didn’t like something, you immediately stopped doing it. There was no guilt involved.",
        "content":" <p> When you were a kid, you would just do things, right? You never thought about the merits of your actions. The beautiful thing was when you didn’t like something, you immediately stopped doing it. There was no guilt involved. </p> <br /> <p> Society leads us to believe that we must have one passion and must follow our passions in life. But that isn’t the case, and it's not always that simple. Passion is a feeling that many people misunderstand. And this confusion leads them to conclude that they have no passion for anything. </p> <br /> <p>What are the things that you often hear about finding your passion?</p> <br /> <ol> <li>Stay healthy.</li> <li>Shift your perspective.</li> <li>Be confident.</li> <li>Stay curious.</li> </ol> <br /> <p> I tried to impose these points on myself for a long time. I believed that my life is meaningless without my passion. In doing so, I was mentally exhausted as I couldn't be better at my interests. </p> <br /> <p> Most of us try to be passionate about what we are good at, as it makes us feel valued. Most of our passions stem from our upbringing or some tragic events in our lives. It really isn’t our own. There wasn’t much thought put into it. Rather, it was given to us. </p> <br /> <p>So, let us look at some ideas of how your passion might look like.</p> <br /> <p> <b>1. Define your own sense of passion</b> </p> <br /> <p> The traditional vision of passion is of a person who wakes up in the morning with a spring in their step and raring to go. But that’s not everyone. There are plenty of people who feel and show their passion differently. For you, your passion might not fill you with a raging fire, it might be more of a glowing ember. So don’t ignore a feeling just because it doesn’t meet society’s definition of what passion is. </p> <br /> <p> <b>2. It's ok to not pursue your passion</b> </p> <br /> <p> There is a myth that people believe about passions is that you must always be ready to follow them. Nobody can feel motivated every single day to pursue their interests. It's not realistic. Consistency differs from motivation. Life happens and you cannot commit to something you believed was a passion. Don't look for perfection in your passion. Else, you will never find it. </p> <br /> <p> <b>3. Your profession can’t always align with your passions</b> </p> <br /> <p> It’s not common for passions to fit nicely into your career. As hard as it may be to hear, you sometimes have to accept that your job — the thing you spend a huge chunk of your life doing — is not something you’ll be passionate about. </p> <br /> <p> <b>4. It's okay to have lots of little passions instead of one big one</b> </p> <br /> <p> Some people have a lot of interests and hobbies but aren’t passionate about anything in particular. This comes back to our first point about what your passion means to you. But you might doubt yourself whether any one of these interests can be your passion. You must understand that these are passions you would go out of your way to do them. You might say that your passion is actually in diversity. </p> <br /> <p> <b>Conclusion</b> </p> <br /> <p> Don’t be worried about your passions. Just enjoy the things that you do every day. Life is all about the little things we do. </p> <br />",
        "date":"February 10, 2021"    
    },
    "6":{
        "id":"6",
        "title":"Pushups — The Magical Exercise",
        "image":"https://miro.medium.com/max/875/1*4kZ5L94qmy6MjVddZj8cKA.jpeg",
        "description":"What do you do when you feel you can’t do anything? If you’re feeling low, it's amazing to know what a little exercise can do for you. So, the next time your mind goes fuzzy, just get down and do 10 pushups.",
        "content":" <p> What do you do when you feel you can’t do anything? If you’re feeling low, it's amazing to know what a little exercise can do for you. So, the next time your mind goes fuzzy, just get down and do 10 pushups. </p> <br /> <p> The pushup is an upper body workout that is a staple in many workouts, from HIIT to yoga to pure strength training. I would like to set the record straight on pushups, explaining the health benefits you’ll get from doing this move regularly. </p> <br /> <p> <b>1. Improves your core strength and stability:</b> </p> <br /> <p> Pushups are a good “bang for your buck” as it works many joints and muscles simultaneously. Pushups when performed correctly work your inner core muscles since they prevent the abdominal wall from bulging forward, which may cause our pelvis to rotate forward and increase the inward curvature in the spine. </p> <br /> <p> <b>2. Improved upper body strength:</b> </p> <br /> <p> It’s not shocking to see that pushups seriously challenge your upper half. After all, you are bending your arms to lower and lift your entire body. Pushups work your pectoral muscles (the muscles in your chest), triceps, and shoulders. Pushups are an efficient and effective exercise for improving upper-body strength on the whole as they hit many different muscle groups at once. </p> <br /> <p> <b>3. Improves posture:</b> </p> <br /> <p> Our attachment with the “tech world” has made us spend our days with hunched shoulders and rounded spine-indicators of poor posture. Pushups can teach our body good positioning. A proper pushup involves your mid-back muscles (rhomboids and scapula) without engaging your neck and top of your shoulders. Core stability is also a factor for your posture, which is also improved by this exercise. </p> <br /> <p> <b>4. Easy to establish the mind-muscle connection:</b> </p> <br /> <p> 10 pushups is an achievable number. It makes you aware of your muscles, you’re taking a few good, deep breaths and you feel a bit stronger! </p> <br /> <p> <b>5. Better than not doing pushups:</b> </p> <br /> <p>Something is always better than nothing.</p> <br /> <p> <b>So, are there any risks of doing pushups every day?</b> </p> <br /> <p> Let me keep it simple for you. None! Pushups are a challenging move, and it’s totally OK if you’re not yet able to do them. A popular regression is to simply drop to your knees and perform pushups from there. </p> <br />",
        "date":"February 3, 2021"    
    },
    "7":{
        "id":"7",
        "title":"The power of waiting",
        "image":"https://miro.medium.com/max/1400/1*l49NO-qkZzWGQla73fbxPg.jpeg",
        "description":"Life in the 21st century is moving so fast that we barely have time to breathe. Put food in the microwave and seconds later you have a hot meal. Ask Alexa, Google, etc., almost any question, and you can have an answer in under a second. It’s easier to find quotes about “seizing the day” versus waiting.",
        "content":" <p> Life in the 21st century is moving so fast that we barely have time to breathe. Put food in the microwave and seconds later you have a hot meal. Ask Alexa, Google, etc., almost any question, and you can have an answer in under a second. It’s easier to find quotes about “seizing the day” versus waiting. </p> <br /> <p> I, for one, have been impatient for most of my life. I’ve always tried to predict my future by considering all the uncertainties that I might face. I used to believe that staying in the same place for a long time is a sign of weakness, a lack of conviction, and an excuse for not taking any action. I’ve come a long way since then. </p> <br /> <p> As a society, we have become addicted to instant gratification and answers. Most people believe that waiting is a waste of time, and it’s best to fill that time with something Our ego or mind is uncomfortable with waiting as it presents a moment of uncertainty in our lives. Time is a precious commodity. It is perhaps one of the reasons why waiting patiently does not always come naturally. </p> <br /> <p> <b>Why must one wait “actively”?</b> </p> <br /> <p> There’s always a proper time for all things. Unfortunately, it’s not the time we want. But there is always a circle of inevitability about it. Try to look at times when you just “knew” what to do, without even thinking about it. What happened then? The decision must’ve felt “inevitable”. It’s as if you were subconsciously prepared for it. Waiting actively is to learn to tune our intuitions and wait with the certainty of reaching our goals. </p> <br /> <p> Let me remind you that this differs completely from procrastination that arises when we want to try something new but are afraid to step out into the unknown. If you want to talk yourself into something, try to wait on it as time goes by, more will be revealed. </p> <br /> <p> <b>Conclusion</b> </p> <br /> <p> Try to ignore the voice which tells you to decide now. What we practice and repeat in life becomes more automatic. So, learn to trust your gut more than your head. Have faith that the right course will unfold at the perfect time. </p> <br />",
        "date":"January 27, 2021"    
    },
    "8":{
        "id":"8",
        "title":"Periodization training-101",
        "image":"https://miro.medium.com/max/1400/1*eK--klYW7DyUNhRd1HNX9g.jpeg",
        "description":"Winston Churchill once said, “Plans are of little importance. But planning is essential”. In order to achieve your goals, plans at the micro and macro-level are important. This applies to our training as well.",
        "content":" <p> Winston Churchill once said, “Plans are of little importance. But planning is essential”. In order to achieve your goals, plans at the micro and macro-level are important. This applies to our training as well. </p> <br /> <p> There are many acute variables in our training. These variables include the number of sets and repetitions, rest periods taken between sets, and the rep speed. Periodization refers to the systematic manipulation of the acute training variables over time, which may vary from hours to even years. </p> <br /> <p> The basis behind periodization is a concept called the general adaptation syndrome. Whenever our body is subjected to some stress, we go through three stages: alarm, adaptation, and exhaustion. As additional stress is placed on the body — let's use heavy training as an example — the body first goes through an alarm reaction. During this stage, the body momentarily gets weaker. But, with continued exposure to this stress, our body super compensates for it and that's how we become stronger. </p> <br /> <p> But, if our body is continually exposed to this stress for a long period of time, our strength adaptations slowly decline. You must expose the muscle to any one training style for just long enough to reap the benefits, but avoid a nosedive of those positive adaptations. </p> <br /> <p>There are various cycles in periodization, such as</p> <br /> <ol> <li><b>Quadrennial cycle-</b>Multi-year training plan.</li> <li><b>Macrocycle-</b>training plans for less than a year.</li> <li><b>Mesocycle-</b>a single training block which lasts for 3–4 weeks.</li> <li><b>Microcycle-</b>one mesocycle’s unit(1 week)</li> <li><b>Workouts-</b>one microcycle’s unit</li> </ol> <br /> <p> The two periodization schemes most commonly used by strength coaches are: </p> <br /> <p> <b>1. Classic/linear periodization training:</b> </p> <br /> <p> This form of training follows a progression of phases through ROM, strength, power, and speed. This model is characterized by longer training periods , and a focus on more general training. Most beginners need to build a strong foundation before they can try advanced training styles. Linear periodization is a great way to slowly build a base without losing focus on what’s important — building your foundation. It is great for progressing in one variable and working towards a peaking point. </p> <br /> <p> <b>2. Non-linear/Undulated periodization:</b> </p> <br /> <p> Non-linear periodization is an excellent way of individually training one variable and secondarily training others at the same time. This method relies on a constant change in stimuli throughout training cycles. As opposed to a linear periodization that focuses on the gradual increase of one variable, this style manipulates multiple variables frequently. It is often used by trainees who have a mature training age (>2 years). </p> <br /> <p> <b>Conclusion</b> </p> <br /> <p> Planning is the most valuable resource we have at your disposal. By using a well-organized and proven process like periodization, you can construct a training timeline that allows you to optimize performance at the optimal times. </p> <br />",
        "date":"January 25, 2021"    
    },
    "9":{
        "id":"9",
        "title":"How to Add Fitness Into Your Daily Routine",
        "image":"https://miro.medium.com/max/1400/1*KSpZNzUo_avjgOCm7EcuGA.jpeg",
        "description":"Do you feel you have no time to exercise? Despite having more and more labor-saving gadgets like internet shopping and car ownership, we still seem to be short of time!.",
        "content":"<p> Do you feel you have no time to exercise? Despite having more and more labor-saving gadgets like internet shopping and car ownership, we still seem to be short of time!. </p> <br /> <p> Our lifestyles have become a constant flurry of activities, moving from one to another, barely having time to breathe. We sideline our exercises simply because we are “busy”. </p> <br /> <p> You already know the myriad benefits of exercise from improving your sleep to keeping you energetic throughout the day. But knowing the benefits and the workout plans isn’t enough. You need the right mindset and smart approach. </p> <br /> <p> While there may be some practical issues like a busy schedule or some illness that may pose a threat to our consistency, the biggest threat is our own mind. Maybe it's a lack of self-confidence or your motivation quickly burns out and you give up quickly. </p> <br /> <p> Whether you’re in a detrained state or you’re a beginner to your fitness journey, there are steps you can take to make exercise less intimidating and painful and more fun and instinctive. </p> <br /> <p> <b>1. Find your exercise purpose</b> </p> <br /> <p> Do you want to be fit and healthy to feel more confident? Complete your first 10K run? Lose weight? Having a reason or purpose behind your workout will help you form a new habit. </p> <br /> <p> <b>2. Set your workout clothes a night before</b> </p> <br /> <p> If you are off to work/college/school in the morning, keep your workout clothes ready the night before. This will definitely motivate you to work out in the morning as it reinforces a positive feeling in you. </p> <br /> <p> <b>3. Workout in the morning</b> </p> <br /> <p> This may not work for everybody. Since you don’t have distractions in the morning, you will focus more on your workout. It feels great to work out, shower, and be ready for your day at 8:00 am. </p> <br /> <p> <b>4. Choose an exercise/activity you like</b> </p> <br /> <p> You might think, “I hate running” and that’s okay. Flexing your self-discipline muscles is often necessary for exercise, but go easy on yourself by choosing a form of exercise that fits your lifestyle, personality, and taste. </p> <br /> <p> <b>5. Track your progress quantitatively</b> </p> <br /> <p> I believe that a key component of achieving any goal is to write it down. It’s also motivating to see the number of days you workout to add up. Write out the detail of your exercise each week. Try to keep a track of the food you eat. But don’t be obsessed with calories. Remember, <b> “not all calories are created equal”.</b> </p> <br /> <p> <b>6. Be flexible</b> </p> <br /> <p> Did you have a workout planned, but life got in your way? No problem. Tomorrow is another day. Don’t be too hard on yourself. </p> <br /> <p> <b>7. Focus more on supersets/circuit training</b> </p> <br /> <p> This point is specifically for the “gym-goers”. Super-setting is a great technique to save time in the gym. You choose workouts for muscle groups that don't complement each other during workouts and perform them alternatively. For example, you can alternate exercises for Chest and Back, Biceps and triceps, quads and hamstrings. Circuit training combines cardiovascular and resistance training in one fast-paced effective session. You focus on different muscle groups without rest for a limited amount of time (30–45 mins) </p> <br /> <p> <b>Conclusion</b> </p> <br /> <p> Setting yourself a goal or challenge will help you concentrate on what is important to you, and it will help you focus on incorporating exercise into your life. It is important to focus on consistency and the quality of workouts. Time is the most valuable resource and with careful planning, you can definitely tap into the strategies and before you know it, you will be able to come up with a healthy and fun exercise routine which will become something of a habit. </p> <br />",
        "date":"January 22, 2021"    
    },
    "10":{
        "id":"10",
        "title":"The Key to Helping Yourself is Helping Others",
        "image":"https://miro.medium.com/max/1400/1*WuUEyPk_jGrkEYAmJGQBTw.jpeg",
        "description":"Have you ever felt joy when you did something good for someone? Perhaps it was the satisfaction of listening to their problems. Or perhaps it was simply standing by their side during their problems.",
        "content":"<p> Have you ever felt joy when you did something good for someone? Perhaps it was the satisfaction of listening to their problems. Or perhaps it was simply standing by their side during their problems. </p> <br /> <p> Most of us are self-centered. Once, I was asked to present my speech in front of my class. I still remember the feeling of giving a talk and knowing for sure that everyone was intently watching you shake, sweat, and stumble nervously throughout it. Unsurprisingly, they were interested in my content rather than my nervousness. I don’t think the physical outlet of my nervousness was an actual phenomenon. We only experience reality through our own unique perspectives. </p> <br /> <p> Helping others gives us an opportunity to share the advice that we need to hear ourselves saying out loud. Hearing ourselves is fantastic. It allows us to realize that we have learned a lot from our experiences and that there are actually actions we can also take to help ourselves based on what we have learned. </p> <br /> <p> Helping others often reminds us to be grateful for what we have. In a time when so many of us are constantly striving to gain more possessions while constantly comparing what we have to what others have, cultivating gratitude can be extremely rewarding. </p> <br /> <p> It’s important to remember that giving doesn’t always feel great. Giving can make us feel depleted and taken advantage of. Here are some tips that will help you give not until it hurts, but until it feels great. </p> <br /> <p> <b>1. Help others through your passion</b> </p> <br /> <p> It’s not about how much we give, it’s about the love and effort we put into giving. Our passion must form the foundation of our empathy and compassion towards others. </p> <br /> <p> <b>2. The Gift of time</b> </p> <br /> <p> Time is the most valuable resource we have. Although we don’t have the same amount of money, we do have time on our hands and can give some amount of this time to help others whether that means to devote ourselves to service or listening about your friend’s problem. </p> <br /> <p> <b>3. Don’t let anyone guilt-trip you into helping others</b> </p> <br /> <p> I don’t encourage people into not helping for causes that don’t excite them but if you are feeling guilt-tripped into giving, chances are you will not be very committed over time to the cause. </p> <br /> <p> When we do, then the more we give, the more we stand closer to our quest to gain purpose, meaning, and happiness in our lives. Next time, if someone reaches out to you, looking for advice on their academic or professional career or personal lives, and if you are in a position where you have the time and energy to help, take this opportunity. The advice you give is also advice you can take. Remember, a person’s useful asset is his heart full of love, an ear ready to listen, and a hand willing to help. </p> <br />",
        "date":"January 21, 2021"    
    }   
}